    Кто    |                Действия                          |      Ожидаемый результат                  
  ...........................................................................................
  Анна     |  ввести логин "anna", пароль "anna-pass",        | открывается каталог, видна роль "user", виден пункт "Профиль", нет пункта "Товары",                                        
              нажать "Войти"                                           модальное окно скрыто      
_________________________________________________________________________________________________________________________________________________                                                             
  Анна     |  поля логин и пароль пустые , нажать "Войти"     | выпадает модальное окно "Ошибка. Код:VALIDATION. Логин и пароль обязятельны"                                    
                                                             
_________________________________________________________________________________________________________________________________________________                                                             
  Анна     |  ввести неизвестный логин "sdfg" , пароль        | выпадает модальное окно "Ошибка. Код:UNAUTHORIZED. Неверный логин или пароль"
              "anna-pass", нажать "Войти"                  
_________________________________________________________________________________________________________________________________________________                                                             
  Анна     |  ввести логин "anna", неверный пароль "anna-pass"| выпадает модальное окно "Ошибка. Код:UNAUTHORIZED. Неверный логин или пароль"
_________________________________________________________________________________________________________________________________________________                                                             
  Борис    |  ввести логин "boris", пароль "boris-pass",      | выпадает модальное окно "Ошибка. Код:BLOCKED. Учетная запись заблокирована"
              нажать "Войти"                                
_________________________________________________________________________________________________________________________________________________                                                             
  Кира     |  ввести логин "kira", пароль "kira-admin",       |  открывается каталог, видна роль "admin", виден пункт "Профиль", есть пункт "Товары",
              нажать "Войти"                                     модальное окно скрыто
_________________________________________________________________________________________________________________________________________________                                                             
  Кира     |  ввести логин "kira", пароль "kira-admin",       |  повторно открывается окно с пустыми полями логин и пароль
              нажать "Войти"--> каталог, нажать "Выйти"                                     
                                                              
                                                             
                                                             
                                                             
                                                             