Feature: Поиск по каталогу.

Scenario: Успешный поиск товара, присутствующего в каталоге.
Given зарегестрированный пользователь на странице каталога.
When покупатель вводит в поле поиска "тетрадь".
Then в таблице остались только товары содержащие слово "тетрадь".
And модалка ошибки не видна.

Scenario: Поиск товара отсутствующего в каталоге, пустой результат не ошибка.
Given зарегестрированный пользователь на странице каталога.
When покупатель вводит в поле поиска "ластик".
Then видна пустая таблица.
And модалка ошибки не видна.
