1.Scenario: Успешный вход обычного пользователя.
  Given: Зарегестрированный пользователь на странице входа.
  When: Анна вводит логин "anna" и пароль "anna-pass", нажимает "Войти".
  Then: Открывается каталог, видна роль "user"
  And:  Виден пункт "Профиль".
  And:  Нет пункта "Товары".
  And:  Модальное окно ошибки скрыто.
  
2.Scenario: Неверный пароль.
  Given: Зарегестрированный пользователь на странице входа.
  When: Анна вводит логин "anna" и неверный пароль "pass-anna", нажимает "Войти".
  Then: выпадает модальное окно "Ошибка. Код:UNAUTHORIZED. Неверный логин или пароль".

3.Scenario: Заблокированная учетная запись.
  Given: Зарегестрированный пользователь на странице входа.
  When: Борис вводит логин "boris" и пароль "boris-pass", нажимает "Войти".
  Then:  выпадает модальное окно "Ошибка. Код:BLOCKED. Учетная запись заблокирована"

4.Scenario: Логин и пароль пустые.
  Given:  Пользователь на странице входа.
  When: Поля логин и пароль пустые, пользователь нажимает "Войти".
  Then: Выпадает модальное окно "Ошибка. Код:VALIDATION. Логин и пароль обязятельны".

5.Scenario: Успешный выход обычного пользователя.
  Given: Зарегестрированный пользователь на странице каталога.
  When: Анна нажимает "Выйти".
  Then: Открывается страница входа с пустыми полями логин и пароль.




